#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_distribution.distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "distribution" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
      ~ aliases                        = [
          - "www.nasipolitici.cz",
        ]
        arn                            = "arn:aws:cloudfront::377434098968:distribution/E219L5F4JUG8FO"
        caller_reference               = "terraform-20200520235424539400000007"
        default_root_object            = "index.html"
        domain_name                    = "d2brstwswnnalf.cloudfront.net"
        enabled                        = true
        etag                           = "E1ILXEO9T9OJPE"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E219L5F4JUG8FO"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = true
        last_modified_time             = "2020-05-21 10:11:04.573 +0000 UTC"
        price_class                    = "PriceClass_All"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {}
        wait_for_deployment            = true

        custom_error_response {
            error_caching_min_ttl = 300
            error_code            = 403
            response_code         = 200
            response_page_path    = "/index.html"
        }

        default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = true
            default_ttl            = 86400
            max_ttl                = 86400
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "S3-production-nasi-politici-frontend"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = false
                query_string_cache_keys = []

                cookies {
                    forward           = "none"
                    whitelisted_names = []
                }
            }
        }

        ordered_cache_behavior {
            allowed_methods        = [
                "DELETE",
                "GET",
                "HEAD",
                "OPTIONS",
                "PATCH",
                "POST",
                "PUT",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = true
            default_ttl            = 86400
            max_ttl                = 86400
            min_ttl                = 0
            path_pattern           = "/api/v1/*"
            smooth_streaming       = true
            target_origin_id       = "qtfl4n"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = [
                    "Authorization",
                    "Content-Type",
                    "X-ApplicationId",
                ]
                query_string            = true
                query_string_cache_keys = []

                cookies {
                    forward           = "all"
                    whitelisted_names = []
                }
            }
        }

        origin {
            domain_name = "3ote774i7l.execute-api.eu-central-1.amazonaws.com"
            origin_id   = "qtfl4n"
            origin_path = "/prod"

            custom_origin_config {
                http_port                = 80
                https_port               = 443
                origin_keepalive_timeout = 5
                origin_protocol_policy   = "https-only"
                origin_read_timeout      = 30
                origin_ssl_protocols     = [
                    "TLSv1",
                    "TLSv1.1",
                    "TLSv1.2",
                ]
            }
        }
        origin {
            domain_name = "production-nasi-politici-frontend.s3.eu-central-1.amazonaws.com"
            origin_id   = "S3-production-nasi-politici-frontend"

            s3_origin_config {
                origin_access_identity = "origin-access-identity/cloudfront/E1F6LULFLFN06B"
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

      ~ viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:377434098968:certificate/c2add764-5eec-4349-b8b2-ac30efa988e1" -> null
          ~ cloudfront_default_certificate = false -> true
          ~ minimum_protocol_version       = "TLSv1.2_2018" -> "TLSv1"
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # aws_ecs_service.monitora will be updated in-place
  ~ resource "aws_ecs_service" "monitora" {
        cluster                            = "arn:aws:ecs:eu-central-1:377434098968:cluster/monitora"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 100
      ~ desired_count                      = 2 -> 1
        enable_ecs_managed_tags            = false
        health_check_grace_period_seconds  = 20
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:eu-central-1:377434098968:service/monitora"
        launch_type                        = "FARGATE"
        name                               = "monitora"
        platform_version                   = "LATEST"
        propagate_tags                     = "NONE"
        scheduling_strategy                = "REPLICA"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:377434098968:task-definition/monitora:1" -> (known after apply)

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "monitora"
            container_port   = 8000
            target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:377434098968:targetgroup/monitora-tg/8a461a902b21de30"
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-02f2ad69487d42a8e",
            ]
            subnets          = [
                "subnet-00d7451c6429f3680",
            ]
        }
    }

  # aws_ecs_service.nasi-politici will be updated in-place
  ~ resource "aws_ecs_service" "nasi-politici" {
        cluster                            = "arn:aws:ecs:eu-central-1:377434098968:cluster/nasi-politici"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 100
      ~ desired_count                      = 2 -> 1
        enable_ecs_managed_tags            = false
        health_check_grace_period_seconds  = 20
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:eu-central-1:377434098968:service/nasi-politici"
        launch_type                        = "FARGATE"
        name                               = "nasi-politici"
        platform_version                   = "LATEST"
        propagate_tags                     = "NONE"
        scheduling_strategy                = "REPLICA"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:377434098968:task-definition/nasi-politici:1" -> (known after apply)

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "nasi-politici"
            container_port   = 5001
            target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:377434098968:targetgroup/nasi-politici-tg/57bacccf5552ea0b"
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-02f2ad69487d42a8e",
            ]
            subnets          = [
                "subnet-00d7451c6429f3680",
            ]
        }
    }

  # aws_ecs_task_definition.monitora must be replaced
-/+ resource "aws_ecs_task_definition" "monitora" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:377434098968:task-definition/monitora:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    command                = []
                    cpu                    = 0
                  + dependsOn              = null
                  + disableNetworking      = null
                  + dnsSearchDomains       = null
                  + dnsServers             = null
                  + dockerLabels           = null
                  + dockerSecurityOptions  = null
                    entryPoint             = []
                    environment            = [
                        {
                            name  = "MONITORA_TOKEN"
                            value = "Token ThwtYIS10zUEQ3KIgguqZ4Rd4H6BgTJ7"
                        },
                    ]
                    essential              = true
                  + extraHosts             = null
                  + firelensConfiguration  = null
                  + healthCheck            = null
                  + hostname               = null
                    image                  = "377434098968.dkr.ecr.eu-central-1.amazonaws.com/monitora:latest"
                  + interactive            = null
                    links                  = []
                  + linuxParameters        = null
                  ~ logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group         = "/ecs/monitora"
                            awslogs-region        = "eu-central-1"
                            awslogs-stream-prefix = "ecs"
                        }
                      + secretOptions = null
                    }
                  + memory                 = null
                  + memoryReservation      = null
                    mountPoints            = []
                    name                   = "monitora"
                    portMappings           = [
                        {
                            containerPort = 8000
                            hostPort      = 8000
                            protocol      = "tcp"
                        },
                    ]
                  + privileged             = null
                  + pseudoTerminal         = null
                  + readonlyRootFilesystem = null
                  + resourceRequirements   = null
                  + secrets                = null
                  + startTimeout           = null
                  + stopTimeout            = null
                  + systemControls         = null
                  + ulimits                = null
                  + user                   = null
                    volumesFrom            = []
                  + workingDirectory       = null
                },
            ]
        )
      ~ cpu                      = "512" -> "256" # forces replacement
        execution_role_arn       = "arn:aws:iam::377434098968:role/ecr-task-execution-role"
        family                   = "monitora"
      ~ id                       = "monitora" -> (known after apply)
      ~ memory                   = "1024" -> "512" # forces replacement
        network_mode             = "awsvpc"
      - requires_compatibilities = [] -> null
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
        task_role_arn            = "arn:aws:iam::377434098968:role/ecr-task-execution-role"
    }

  # aws_ecs_task_definition.nasi-politici must be replaced
-/+ resource "aws_ecs_task_definition" "nasi-politici" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:377434098968:task-definition/nasi-politici:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    command                = []
                    cpu                    = 0
                  + dependsOn              = null
                  + disableNetworking      = null
                  + dnsSearchDomains       = null
                  + dnsServers             = null
                  + dockerLabels           = null
                  + dockerSecurityOptions  = null
                    entryPoint             = []
                    environment            = [
                        {
                            name  = "ASPNETCORE_MonitoraApiUrl"
                            value = "http://monitora.internal.nasipolitici.cz/"
                        },
                        {
                            name  = "ASPNETCORE_HlidacAuthenticationToken"
                            value = "2b5eb6327814415ab88d71234fb3cc0a"
                        },
                        {
                            name  = "ASPNETCORE_CzFinToken"
                            value = "13591b1201d9091a0aa019314415ab8d"
                        },
                        {
                            name  = "ASPNETCORE_MailAuthenticationToken"
                            value = "2b5eb6327814415ab88d71234fb3cc0a"
                        },
                    ]
                    essential              = true
                  + extraHosts             = null
                  + firelensConfiguration  = null
                  + healthCheck            = null
                  + hostname               = null
                    image                  = "377434098968.dkr.ecr.eu-central-1.amazonaws.com/nasi-politici:latest"
                  + interactive            = null
                    links                  = []
                  + linuxParameters        = null
                  ~ logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group         = "/ecs/nasi-politici"
                            awslogs-region        = "eu-central-1"
                            awslogs-stream-prefix = "ecs"
                        }
                      + secretOptions = null
                    }
                  + memory                 = null
                  + memoryReservation      = null
                    mountPoints            = []
                    name                   = "nasi-politici"
                    portMappings           = [
                        {
                            containerPort = 5001
                            hostPort      = 5001
                            protocol      = "tcp"
                        },
                    ]
                  + privileged             = null
                  + pseudoTerminal         = null
                  + readonlyRootFilesystem = null
                  + resourceRequirements   = null
                  + secrets                = null
                  + startTimeout           = null
                  + stopTimeout            = null
                  + systemControls         = null
                  + ulimits                = null
                  + user                   = null
                    volumesFrom            = []
                  + workingDirectory       = null
                },
            ]
        )
      ~ cpu                      = "512" -> "256" # forces replacement
        execution_role_arn       = "arn:aws:iam::377434098968:role/ecr-task-execution-role"
        family                   = "nasi-politici"
      ~ id                       = "nasi-politici" -> (known after apply)
      ~ memory                   = "1024" -> "512" # forces replacement
        network_mode             = "awsvpc"
      - requires_compatibilities = [] -> null
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
        task_role_arn            = "arn:aws:iam::377434098968:role/ecr-task-execution-role"
    }

Plan: 2 to add, 3 to change, 2 to destroy.
```

</details>

*Workflow: `Terraform Plan on PR`, Action: `hashicorpterraform-github-actions3`, Working Directory: `infrastructure/aws`, Workspace: `default`*
